
{
  "hero.title": "Hi, I’m Matías Deluca",
  "hero.subtitle": "Full Stack Developer passionate about crafting high-performance web experiences.",
  "hero.cta": "Get in touch",
  "hero.downloadCV": "Download CV",
  "nav.home": "Home",
  "nav.about": "About",
  "nav.skills": "Skills",
  "nav.experience": "Experience",
  "nav.projects": "Projects",
  "nav.contact": "Contact",
  "about.title": "About me",
  "about.text": "I’m a Full Stack Developer with 3+ years of experience in JavaScript/TypeScript, React, Node and MongoDB. I love turning ideas into robust products, optimizing performance and user experience. I’m looking to contribute to teams that value code quality and continuous learning.",
  "skills.title": "Skills",
  "experience.title": "Experience",
  "experience.role": "Freelance Full Stack Developer",
  "experience.period": "(Feb 2022 – Present)",
  "experience.description": "Over the past 3 years as a Freelance Full Stack Developer, I’ve partnered with startups, agencies and entrepreneurs, driving end-to-end development: Requirements analysis and architecture proposals. Building SEO-friendly SPAs with React and Next.js, optimized for performance. Developing RESTful APIs and microservices using Node.js, Express and MongoDB. Integrating payment gateways, third-party services and authentication (JWT, OAuth). Crafting accessible, responsive UIs and implementing tests with Jest/RTL. Deploying and managing infrastructure on Azure and Docker.",
  "experience.bullet1": "Implemented performance optimizations, reducing load times by 40 %.",
  "experience.bullet2": "Integrated third-party APIs and developed custom RESTful APIs.",
  "experience.bullet3": "Designed and built intuitive, responsive user interfaces for desktop and mobile.",
  "experience.bullet4": "Worked directly with stakeholders to define scope, prioritize deliverables and refine the roadmap.",
  "experience.bullet5": "Monitored and continuously optimized key metrics (LCP, TTFB, TBT), achieving 40 % improvements.",
  "experience.bullet6": "Authored technical documentation for code, promoting clean code and thorough PR reviews.",
  "projects.title": "Projects",
  "projects.repo": "GitHub",
  "projects.demo": "Live Demo",
  "projects.soon": "More projects coming soon…",
  "projects.project1.title": "Project Pura Genetica",
  "projects.project1.description":"Pura Genética is a static online store for sports supplements built with HTML5, SCSS, and Bootstrap 4. The site: Uses CSS Grid and Flexbox for a fully responsive layout. Organizes styles in SCSS (partials for each section) and compiles them with Sass. Integrates Bootstrap carousel and navbar, customized with its own styling. This project helped me solidify the basics of responsive design and CSS modularization in my early front-end development journey.",
  "contact.title": "Contact",
  "contact.intro": "Want to work together or just say hi? Reach me at:",
  "contact.emailLabel": "Email:",
  "contact.linkedinLabel": "LinkedIn:",
  "contact.githubLabel": "GitHub:",
  "footer.follow": "Follow me on:",
  "footer.backToTop": "Back to top",
  "form.name": "Name",
  "form.email": "Email",
  "form.message": "Message",
  "form.submit": "Send",
  "form.sending": "Sending...",
  "form.success": "Message sent!",
  "form.error": "Error sending"
}

