{
  "hero.title": "Hola, soy Matías Deluca",
  "hero.subtitle": "Full Stack Developer apasionado por crear experiencias web de alto rendimiento.",
  "hero.cta": "Contáctame",
  "hero.downloadCV": "Descargar CV",
  "nav.home": "Inicio",
  "nav.about": "Sobre mi",
  "nav.skills": "Habilidades",
  "nav.experience": "Experiencia",
  "nav.projects": "Proyectos",
  "nav.contact": "Contacto",
  "about.title": "Sobre mí",
  "about.text": "Soy Full Stack Developer con +3 años de experiencia en JavaScript/TypeScript, React, Node y MongoDB. Disfruto transformar ideas en productos robustos, optimizando la performance y la experiencia de usuario. Busco aportar en equipos que valoren la calidad de código y el aprendizaje continuo.",
  "skills.title": "Habilidades",
  "experience.title": "Experiencia",
  "experience.role": "Freelance Full Stack Developer",
  "experience.period": "(Feb 2022 – Presente)",
  "experience.description": "Durante estos 3 años como Freelance Full Stack Developer, he trabajado con startups, agencias y emprendedores, liderando el ciclo completo de desarrollo: Análisis de requerimientos y propuestas de arquitectura. Implementación de SPAs con React y Next.js optimizadas para SEO y performance. Desarrollo de APIs RESTful y microservicios con Node.js, Express y MongoDB. Integración de pasarelas de pago, servicios externos y autenticación (JWT, OAuth). Diseño de interfaces responsive accesibles y testing con Jest/RTL. Despliegue y configuración de infraestructuras en Azure y Docker.",
  "experience.bullet1": "Implementación de optimizaciones de rendimiento, reduciendo los tiempos de carga en un 40 %.",
  "experience.bullet2": "Integración de APIs de terceros y desarrollo de APIs RESTful personalizadas.",
  "experience.bullet3": "Diseño y creación de interfaces intuitivas y responsivas para desktop y mobile.",
  "experience.bullet4": "Colaboración directa con stakeholders para definir alcance, priorizar entregables y ajustar el roadmap.",
  "experience.bullet5": "Monitorización y optimización continua de métricas clave (LCP, TTFB, TBT) logrando mejoras del 40%.",
  "experience.bullet6": "Documentación técnica de código, fomentando prácticas de código limpio y revisiones de PR.",
  "projects.title": "Proyectos",
  "projects.soon": "Próximamente...",
  "contact.title": "Contacto",
  "contact.intro": "Si querés que trabajemos juntos o simplemente decir hola, escribime:",
  "contact.emailLabel": "Email:",
  "contact.linkedinLabel": "LinkedIn:",
  "contact.githubLabel": "GitHub:",
  "footer.follow": "Sígueme en:",
  "footer.backToTop": "Volver arriba",
  "form.name": "Nombre",
  "form.email": "Email",
  "form.message": "Mensaje",
  "form.submit": "Enviar",
  "form.sending": "Enviando...",
  "form.success": "¡Mensaje enviado!",
  "form.error": "Error al enviar"
}
